# Pandas 2 - Questions
Â© Advanced Analytics, Amir Ben Haim, 2024

## Cleaning Data

Data containing malformed strings, Python, lists and missing data.
Tidy it up so you can get on with the analysis.

### Exercise 1

Import pandas under the name `pd`

In [1]:
import pandas as pd

### Exercise 2

Consider the following Python dictionary `data`:

``` python
data = {
        'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 'Budapest_PaRis', 'Brussels_londOn'],
        'FlightNumber': [10045, None, None, None, 10085],
        'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
        'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', '12. Air France', '"Swiss Air"'],
        'Landed':['yes','no','yes','no','no']
        }
```
<br>
Create a DataFrame `df` from this dictionary `data`.
<br>

In [5]:
data = {
        'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 'Budapest_PaRis', 'Brussels_londOn'],
        'FlightNumber': [10045, None, None, None, 10085],
        'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
        'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', '12. Air France', '"Swiss Air"'],
        'Landed':['yes','no','yes','no','no']
        }
df = pd.DataFrame(data)
df

            From_To  FlightNumber  RecentDelays              Airline Landed
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)    yes
1      MAdrid_miLAN           NaN            []    <Air France> (12)     no
2  londON_StockhOlm           NaN  [24, 43, 87]  (British Airways. )    yes
3    Budapest_PaRis           NaN          [13]       12. Air France     no
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"     no

### Exercise 3

The From\_To column would be better as two separate columns!
<br>Split each string on the underscore delimiter `_` to give a <u>new temporary DataFrame</u> with the correct values.
<br>Assign the correct column names to this temporary DataFrame.

In [10]:
x=df.From_To.str.split('_', expand=True)
x.columns = ["From", "To"]
x

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

### Exercise 4

Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame.
<br>Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [11]:
x["From"] = x.From.str.capitalize()
x["To"] = x.To.str.capitalize()
x

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

### Exercise 5

Delete the From_To column from `df` and attach the <u>temporary DataFrame</u> from the previous questions.

In [12]:
df

            From_To  FlightNumber  RecentDelays              Airline Landed
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)    yes
1      MAdrid_miLAN           NaN            []    <Air France> (12)     no
2  londON_StockhOlm           NaN  [24, 43, 87]  (British Airways. )    yes
3    Budapest_PaRis           NaN          [13]       12. Air France     no
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"     no

In [13]:
df = df.drop('From_To',axis=1)
df = df.join(x)
df

   FlightNumber  RecentDelays              Airline Landed      From         To
0       10045.0      [23, 47]               KLM(!)    yes    London      Paris
1           NaN            []    <Air France> (12)     no    Madrid      Milan
2           NaN  [24, 43, 87]  (British Airways. )    yes    London  Stockholm
3           NaN          [13]       12. Air France     no  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"     no  Brussels     London

### Exercise 6

In the Airline column, you can see some extra punctuation and symbols have appeared around the airline names.
<br>Pull out just the airline name. E.g. `'(British Airways. )'` should become `'British Airways'`.

In [14]:
df['Airline'] = df['Airline'].str.extract('([a-zA-Z\\s]+)', expand=False)
df

   FlightNumber  RecentDelays          Airline Landed      From         To
0       10045.0      [23, 47]              KLM    yes    London      Paris
1           NaN            []       Air France     no    Madrid      Milan
2           NaN  [24, 43, 87]  British Airways    yes    London  Stockholm
3           NaN          [13]       Air France     no  Budapest      Paris
4       10085.0      [67, 32]        Swiss Air     no  Brussels     London

### Exercise 7

In the RecentDelays column, the values have been entered into the DataFrame as a list.
<br>We would like each first value in its own column, each second value in its own column, and so on.
<br>If there isn't an Nth value, the value should be NaN.
<br>Expand the Series of lists into a DataFrame named `delays`, rename the columns `delay_1`, `delay_2`, etc.
<br>And replace the unwanted RecentDelays column in `df` with `delays`.

In [19]:
T = df['RecentDelays'].apply(pd.Series, dtype = int)
T.columns = ['delay_{}'.format(n) for n in range(1, len(T.columns)+1)]
df = df.drop('RecentDelays', axis=1).join(T)
df

,FlightNumber,Airline,Landed,From,To,delay_1,delay_2,delay_3
0,10045.0,KLM,yes,London,Paris,23.0,47.0,NaN
1,NaN,Air France,no,Madrid,Milan,NaN,NaN,NaN
2,NaN,British Airways,yes,London,Stockholm,24.0,43.0,87.0
3,NaN,Air France,no,Budapest,Paris,13.0,NaN,NaN
4,10085.0,Swiss Air,no,Brussels,London,67.0,32.0,NaN

### Exercise 8

The 'Landed' column contains the values 'yes' and 'no'.
<br>Replace this column with a column of boolean values: 'yes' should be `True` and 'no' should be `False`.
<br>
**HINT:**
`map()`

In [20]:
df["Landed"] = df["Landed"].map({"yes": True, "no": False})
df

,FlightNumber,Airline,Landed,From,To,delay_1,delay_2,delay_3
0,10045.0,KLM,True,London,Paris,23.0,47.0,NaN
1,NaN,Air France,False,Madrid,Milan,NaN,NaN,NaN
2,NaN,British Airways,True,London,Stockholm,24.0,43.0,87.0
3,NaN,Air France,False,Budapest,Paris,13.0,NaN,NaN
4,10085.0,Swiss Air,False,Brussels,London,67.0,32.0,NaN

### Exercise 9

In the 'Airline' column, change the 'Air France' entries to 'El-Al'.
<br>
**HINT:**
`replace()`

In [59]:
df["Airline"] = df["Airline"].str.replace("Air France","El-Al")
df

,FlightNumber,Airline,Landed,From,To,delay_1,delay_2,delay_3
0,10045,KLM,True,London,Paris,23.0,47.0,NaN
1,10055,El-Al,False,Madrid,Milan,NaN,NaN,NaN
2,10065,British Airways,True,London,Stockholm,24.0,43.0,87.0
3,10075,El-Al,False,Budapest,Paris,13.0,NaN,NaN
4,10085,Swiss Air,False,Brussels,London,67.0,32.0,NaN

### Exercise 10

Append a new row 'k' to `df` with your choice of values for each column.

In [34]:
k = {
    'FlightNumber': 555,
        'Airline': 'El-Al',
        'Landed':'True',
        'From': 'Tel Aviv',
        'To': 'London',
        'delay_1': 5,
        'delay_2': 40,
        'delay_1': 15
}
df.loc[5]=k
df = df.rename(index={5: "k"})
df

,FlightNumber,Airline,Landed,From,To,delay_1,delay_2,delay_3
0,10045.0,KLM,True,London,Paris,23.0,47.0,NaN
1,NaN,El-Al,False,Madrid,Milan,NaN,NaN,NaN
2,NaN,British Airways,True,London,Stockholm,24.0,43.0,87.0
3,NaN,El-Al,False,Budapest,Paris,13.0,NaN,NaN
4,10085.0,Swiss Air,False,Brussels,London,67.0,32.0,NaN
k,555.0,El-Al,True,Tel Aviv,London,15.0,40.0,NaN

### Exercise 11

Delete that row ('k') to return the original DataFrame.

In [35]:
df.drop('k', inplace = True)
df

,FlightNumber,Airline,Landed,From,To,delay_1,delay_2,delay_3
0,10045.0,KLM,True,London,Paris,23.0,47.0,NaN
1,NaN,El-Al,False,Madrid,Milan,NaN,NaN,NaN
2,NaN,British Airways,True,London,Stockholm,24.0,43.0,87.0
3,NaN,El-Al,False,Budapest,Paris,13.0,NaN,NaN
4,10085.0,Swiss Air,False,Brussels,London,67.0,32.0,NaN

### Exercise 12

For column 'FlightNumber' check if the <u>FIRST VALUE (check the min index) is `None`</u>.
<br>If the value is 'None' set it to '1000', else print the FIRST VALUE.

In [38]:
# finding the First min index
df.index.min()

0

In [55]:
# Checking if the first value is None
if pd.isna(df.loc[0,"FlightNumber"]):
    df.loc[0,"FlightNumber"]=1000
else:
    print(df.loc[0,"FlightNumber"])

10045.0

### Exercise 13

Use a loop to fill all the missing values.
Missing values should be filled as the <u>value before + 10</u>

In [57]:
for i in df.index:
        while pd.isna(df.loc[i,"FlightNumber"]):
            df.loc[i,"FlightNumber"] = df.loc[i-1,"FlightNumber"] + 10
df

,FlightNumber,Airline,Landed,From,To,delay_1,delay_2,delay_3
0,10045.0,KLM,True,London,Paris,23.0,47.0,NaN
1,10055.0,El-Al,False,Madrid,Milan,NaN,NaN,NaN
2,10065.0,British Airways,True,London,Stockholm,24.0,43.0,87.0
3,10075.0,El-Al,False,Budapest,Paris,13.0,NaN,NaN
4,10085.0,Swiss Air,False,Brussels,London,67.0,32.0,NaN

### Exercise 14

Change column 'FlightNumber' to data type int

In [58]:
df['FlightNumber'] = df['FlightNumber'].astype(int)
df

,FlightNumber,Airline,Landed,From,To,delay_1,delay_2,delay_3
0,10045,KLM,True,London,Paris,23.0,47.0,NaN
1,10055,El-Al,False,Madrid,Milan,NaN,NaN,NaN
2,10065,British Airways,True,London,Stockholm,24.0,43.0,87.0
3,10075,El-Al,False,Budapest,Paris,13.0,NaN,NaN
4,10085,Swiss Air,False,Brussels,London,67.0,32.0,NaN